;==================================================
;			内核数据段
;==================================================
;导入C语言编写出的内核主函数
extern rabbit_main

;导出函数
global _start
[section .data]
bits 32
	nop
;-------------------------------------------------
;=======================================
;			内核堆栈段
;=======================================

[section .bss]
StackSpace : resb 0x1000 ;分配4KB栈空间
StackTop:
;=======================================
;			内核代码段
;=======================================
[section .text]
_start:
	mov  ax,ds
	mov  es,ax
	mov  fs,ax
	mov  ss,ax
	mov  esp,StackTop
	jmp  rabbit_main
;实际上并不会跳转到这里来	
SysEnd:
	HLT
	jmp  SysEnd
